<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2024/1/6
 * Time: 10:15
 */
return [
    "query_success" => '查询成功',
    "query_fail" => '查无数据',
    "query_out_range" => "查询类型不在范围内",

    "action_success" => '操作成功',
    "action_fail" => '操作失败',
    "action_machine_overtime" => "操作超时，请确认设备是否在线",

    "add_success" => '添加成功',
    "add_fail" => '添加失败',

    "update_success" => '修改成功',
    "update_fail" => '修改失败',

    "del_success" => '删除成功',
    "del_fail" => '删除失败',

    "copy_success" => '复制成功',
    "copy_fail" => '复制失败',

    "try_catch" => "程序异常",

    "controller_name_require" => '控制器名不能为空',
    "query_machine_no_data" => '查无设备信息',

    "uploadSuccess" => '上传成功',
    "fileSize" => '文件太大',
    "fileExt" => '不支持的上传文件类型',


    "export_success" => '导出成功',
    "export_fail" => '导出失败',

    "deviceErrorCode" => [
        "1000001" => "主柜设备通信错误",
        "1000002" => "副柜设备通信错误",
        "1000100" => "xy轴移动受阻错误",
        "1000101" => "商品不足",
        "1000102" => "取货失败",
        "1100000" => "摄像头调用错误",
        "1001049" => "主控板IO控制错误 - 返回指令 - 解析",
        "1001242" => "主控板心跳查询错误 - 返回指令 - 解析",
        "1001241" => "主控板复位错误 - 返回指令 - 解析",
        "1001129" => "取料门或回收箱运动错误 - 返回指令 - 解析",
        "1001130" => "取料门或回收箱运动错误 - 返回指令 - 解析",
        "1032018" => "XY轴运动错误 - 返回指令 - 解析",
        "1032024" => "XY轴刹车错误 - 返回指令 - 解析",
        "1032049" => "气阀与气泵控制错误 - 返回指令 - 解析",
        "1032244" => "气压传感器错误 - 返回指令 - 解析",
        "1032136" => "XY初始化错误 - 返回指令 - 解析",
        "1032241" => "XY复位错误 - 返回指令 - 解析",
        "1032242" => "XY心跳查询错误 - 返回指令 - 解析",
        "1048018" => "Z轴运动错误 - 返回指令 - 解析",
        "1048024" => "Z轴刹车错误 - 返回指令 - 解析",
        "1048136" => "Z初始化错误 - 返回指令 - 解析",
        "1048244" => "机头感应器错误 - 返回指令 - 解析",
        "1048138" => "机头摄像头错误 - 返回指令 - 解析",
        "1048241" => "Z复位错误 - 返回指令 - 解析",
        "1048242" => "Z心跳查询错误 - 返回指令 - 解析",
        "1048245" => "机头扫描错误 - 返回指令 - 解析",
        "1096018" => "取料箱运动错误 - 返回指令 - 解析",
        "1096024" => "取料箱刹车错误 - 返回指令 - 解析",
        "1096049" => "取料箱IO控制错误 - 返回指令 - 解析",
        "1096129" => "取料箱履带控制错误 - 返回指令 - 解析",
        "1096130" => "取料箱履带控制错误 - 返回指令 - 解析",
        "1096136" => "取料箱初始化错误 - 返回指令 - 解析",
        "1096243" => "取料箱光检错误 - 返回指令 - 解析",
        "1096241" => "取料箱复位错误 - 返回指令 - 解析",
        "1096242" => "取料箱心跳查询错误 - 返回指令 - 解析",
        "1097243" => "取货门光检错误 - 返回指令 - 解析",
    ],

    "VNotice" => [
        "ao_id_require" => "组织架构ID不能为空",
        "sendType_require" => "发送类型不能为空",
        "sendType_in" => "发送类型不在范围内",
        "templateType_require" => "消息类型不能为空",
        "config_require" => "查无配置信息",
        "template_require" => "查无消息模板信息",
        "receiver_require" => "查无收件人信息",
    ],
];