<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2024/1/6
 * Time: 10:15
 */
return [

    "where_not_empty" => "查询条件不能为空",
    "query_success" => '查询成功',
    "query_fail" => '查无数据',
    "query_out_range" => "查询类型不在范围内",

    "action_success" => '操作成功',
    "action_fail" => '操作失败',
    "action_machine_overtime" => "操作超时，请确认设备是否在线",

    "add_success" => '添加成功',
    "add_fail" => '添加失败',

    "update_success" => '修改成功',
    "update_fail" => '修改失败',

    "del_success" => '删除成功',
    "del_fail" => '删除失败',

    "copy_success" => '复制成功',
    "copy_fail" => '复制失败',

    "try_catch" => "程序异常",

    "controller_name_require" => '控制器名不能为空',
    "query_machine_no_data" => '查无设备信息',

    "uploadSuccess" => '上传成功',
    "fileSize" => '文件太大',
    "fileExt" => '不支持的上传文件类型',

    "error_api" => "错误API地址",

    "export_success" => '导出成功',
    "export_fail" => '导出失败',

    "mac_require" => "Mac地址不能为空",
    "mac_not_match" => "Mac地址与后台配置不匹配",

    "tException" => [
        "out_fail" => '出货失败',
        "unclaimed" => '订单有商品未取',
    ],

    "deviceErrorCode" => [
        "1000001" => "主柜设备通信错误",
        "1000002" => "副柜设备通信错误",
        "1000100" => "xy轴移动受阻错误",
        "1000101" => "商品不足",
        "1000102" => "取货失败",

        "1100000" => "摄像头调用错误",
        "1200000" => "营业逻辑中柜门打开",
        "12000000" => "营业逻辑中柜门打开",
        "10000104" => "商品运至出料箱失败",

        "100104900" => "LED灯控制故障（03 xx） - 返回指令 - 解析",
        "100104901" => "设备柜门打开故障（05 01） - 返回指令 - 解析",
        "100104902" => "设备柜门打开提醒继电器故障（04 00 / 04 01） - 返回指令 - 解析",
        "100104903" => "设备气泵开关故障（01 00 / 01 01） - 返回指令 - 解析",
        "100112900" => "取货门关闭故障 - 返回指令 - 解析",
        "100112901" => "回收箱向外移动故障 - 返回指令 - 解析",
        "100113000" => "取货门打开移动故障 - 返回指令 - 解析",
        "100113001" => "回收箱向内移动故障 - 返回指令 - 解析",
        "100122200" => "定时开关机故障 - 返回指令 - 解析",
        "100124200" => "取货门查询状态故障 - 返回指令 - 解析",
        "100124201" => "回收箱查询状态故障 - 返回指令 - 解析",

        "103201800" => "X轴移动故障 - 返回指令 - 解析",
        "103201801" => "Y轴移动故障 - 返回指令 - 解析",
        "103202400" => "X轴移动刹车故障 - 返回指令 - 解析",
        "103202401" => "Y轴移动刹车故障 - 返回指令 - 解析",
        "103204900" => "泄气阀开关故障 - 返回指令 - 解析",
        "103213600" => "X轴初始化故障 - 返回指令 - 解析",
        "103213601" => "Y轴初始化故障 - 返回指令 - 解析",
        "103224100" => "X轴复位故障 - 返回指令 - 解析",
        "103224101" => "Y轴复位故障 - 返回指令 - 解析",
        "103224200" => "X轴状态查询故障 - 返回指令 - 解析",
        "103224201" => "Y轴状态查询故障 - 返回指令 - 解析",
        "103224700" => "气压传感器故障 - 返回指令 - 解析",

        "104801800" => "z1轴移动故障 - 返回指令 - 解析",
        "104801801" => "z2轴移动故障 - 返回指令 - 解析",
        "104813600" => "z1轴初始化故障 - 返回指令 - 解析",
        "104813601" => "z2轴初始化故障 - 返回指令 - 解析",
        "104813700" => "z2轴初始化故障 - 返回指令 - 解析",
        "104813701" => "货物整理探头移动故障 - 返回指令 - 解析",
        "104813800" => "机头摄像头启动故障 - 返回指令 - 解析",
        "104824100" => "Z1轴复位故障 - 返回指令 - 解析",
        "104824101" => "Z2轴复位故障 - 返回指令 - 解析",
        "104824200" => "Z1轴状态查询故障 - 返回指令 - 解析",
        "104824201" => "Z2轴状态查询故障 - 返回指令 - 解析",
        "104824500" => "Z2轴状态查询故障 - 返回指令 - 解析",
        "104824900" => "货物探头检测故障 - 返回指令 - 解析",

        "105018500" => "路由电源控制故障 - 返回指令 - 解析",

        "108024600" => "柜门状态检测故障 - 返回指令 - 解析",

        "109601800" => "送料箱移动故障 - 返回指令 - 解析",
        "109602400" => "送料箱履带停止故障 - 返回指令 - 解析",
        "109604900" => "送料箱灯光控制故障 - 返回指令 - 解析",
        "109612900" => "履带向内滚动故障 - 返回指令 - 解析",
        "109613000" => "履带向外滚动故障 - 返回指令 - 解析",
        "109613600" => "送料箱初始化故障 - 返回指令 - 解析",
        "109624100" => "送料箱复位故障 - 返回指令 - 解析",
        "109624200" => "送料箱查询状态故障 - 返回指令 - 解析",
        "109624300" => "送料箱光栅故障 - 返回指令 - 解析 ",

        "120325000" => "机头摄像头读取图片故障 - 返回指令 - 解析",
        "120325100" => "机头摄像头读取图片故障 - 返回指令 - 解析",
        "2000000" => "测试故障内容",
    ],

    "VNotice" => [
        "ao_id_require" => "组织架构ID不能为空",
        "sendType_require" => "发送类型不能为空",
        "sendType_in" => "发送类型不在范围内",
        "templateType_require" => "消息类型不能为空",
        "config_require" => "查无配置信息",
        "template_require" => "查无消息模板信息",
        "receiver_require" => "查无收件人信息",
    ],
];